#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.log_group-fe.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=community-challenge/frontend-task/log]
module.frontend-image.aws_ecr_repository.foo: Refreshing state... [id=community-challenge-frontend]
aws_ecs_cluster.cc-cluster: Refreshing state... [id=arn:aws:ecs:us-west-2:819383208824:cluster/community-challenge-cluster]
module.log_group-be.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=community-challenge/backend-task/log]
aws_secretsmanager_secret.api_email: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:819383208824:secret:CF_API_EMAIL-test-5-NbIXdx]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b56b617c41b013b7]
module.backend-image.aws_ecr_repository.foo: Refreshing state... [id=community-challenge-backend]
data.aws_iam_policy_document.ecs-assume-role-role: Reading...
aws_iam_policy.ecs-policy: Refreshing state... [id=arn:aws:iam::819383208824:policy/terraform-20231103010657641000000001]
aws_secretsmanager_secret.zone: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:819383208824:secret:ZONE_ID-test-5-Hn2T9E]
data.aws_iam_policy_document.ecs-assume-role-role: Read complete after 0s [id=258469924]
aws_iam_role.task_role: Refreshing state... [id=community-challenge-task-role]
aws_secretsmanager_secret.api_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:819383208824:secret:CF_API_KEY-test-5-IYtLJs]
aws_iam_role.ecs_role: Refreshing state... [id=community-challenge-ecs-role]
aws_iam_role_policy.task_policy: Refreshing state... [id=community-challenge-task-role:community-challenge-task_policy]
aws_iam_role_policy_attachment.ecs-policy-att: Refreshing state... [id=community-challenge-ecs-role-20231103010658072000000002]
aws_ecs_task_definition.service: Refreshing state... [id=community-challenge-family]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0a090d4849550faf2]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b00a07f6575af07d]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0bbc8f233547b8837]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a981814ac858fb76]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0afadec164048c5ea]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0afefbb8063346faa]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-03b923c26afe0a2c6]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f66c862ca7635d5c]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0ff43eb33ebab02cc]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0b319154e060ffe78]
aws_lb_target_group.test: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:819383208824:targetgroup/community-challenge-tg/1e120427d3186c82]
aws_security_group.lb-sg: Refreshing state... [id=sg-0664d9808bfdc1cb3]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-009aec2abe4869846]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0a981814ac858fb761080289494]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-08e51bf33da5cdea5]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-043d1acfb60b1537a]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-06db9a20135d6d7d1]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06a1ef38229a8db21]
aws_lb.ecs-lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:819383208824:loadbalancer/app/community-challenge-lb/4842e4e1cf37b438]
aws_security_group.ecs-sg: Refreshing state... [id=sg-0a3a16565e02df112]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-01aee69a15d7e5926]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0bbc8f233547b88371080289494]
aws_ecs_service.cc-service: Refreshing state... [id=arn:aws:ecs:us-west-2:819383208824:service/community-challenge-cluster/community-challenge-service]
aws_lb_listener.ec-lb-listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:819383208824:listener/app/community-challenge-lb/4842e4e1cf37b438/53839aacf0308efc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.task-endpoint will be created
  + resource "aws_security_group" "task-endpoint" {
      + arn                    = (known after apply)
      + description            = "Allow http traffic from tasks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic from backend task"
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0a3a16565e02df112",
                ]
              + self             = false
              + to_port          = 3000
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic from frontend task"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0a3a16565e02df112",
                ]
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "community-challenge-task-endpoint-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0b56b617c41b013b7"
    }

  # aws_vpc_endpoint.logs will be created
  + resource "aws_vpc_endpoint" "logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0a3a16565e02df112",
        ]
      + service_name          = "com.amazonaws.us-west-2.logs"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-0f66c862ca7635d5c",
          + "subnet-0ff43eb33ebab02cc",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0b56b617c41b013b7"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @realexcel2021, Action: `pull_request`*